inp = int(input())
eds = ["один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
des = ["двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
sot = ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]

k = len(str(inp))
if inp < 20:
    print(eds[inp-1])
elif inp < 1000:
    if inp >= 100 and (inp/100)%10 != 0:
        print(sot[(inp//100) - 1], end=" ")
    if inp >= 10 and (inp/10)%10 != 0:
        print(des[(inp//10)%10 - 2], end=" ")
    if inp % 10 != 0:
        print(eds[inp%10-1], end="")
elif inp == 1000:
    print("Тысяча!")
else:
    print("Число больше 1000!")
